Revit 2024 API
AnalysisDisplayVectorSettings Class
 Contains vector settings for analysis display style element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public class AnalysisDisplayVectorSettings : IDisposable
Visual Basic
Public Class AnalysisDisplayVectorSettings _
	Implements IDisposable
Visual C++
public ref class AnalysisDisplayVectorSettings : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings
See Also
AnalysisDisplayVectorSettings Members
Autodesk.Revit.DB.Analysis Namespace